nc: 1 #snowpole
depth_multiple: 0.33 # depth multiple for the model
width_multiple: 0.25 # width multiple for the model

anchors:
  - [10,13, 16,30, 33,23]
  - [30,61, 62,45, 59,119]
  - [116,90, 156,198, 373,326]

# YOLOv11n backbone and head, with 3x3 and 5x5 convolutions, and SPPF layer
backbone:
  [
    [-1, 1, Conv, [32, 3, 2]],
    [-1, 1, Conv, [64, 3, 2]],
    [-1, 3, C2f, [64]],
    [-1, 1, Conv, [128, 3, 2]],
    [-1, 6, C2f, [128]],
    [-1, 1, Conv, [256, 3, 2]],
    [-1, 6, C2f, [256]],
    [-1, 1, Conv, [512, 3, 2]],
    [-1, 3, C2f, [512]],
    [-1, 1, SPPF, [512, 5]],
  ]

head:
  [
    [-1, 1, Conv, [256, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],
    [[-1, 6], 1, Concat, [1]],
    [-1, 3, C2f, [256]],
    [-1, 1, Conv, [128, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],
    [[-1, 4], 1, Concat, [1]],
    [-1, 3, C2f, [128]],
    [-1, 1, Conv, [128, 3, 2]],
    [[-1, 17], 1, Concat, [1]],
    [-1, 3, C2f, [256]],
    [-1, 1, Conv, [256, 3, 2]],
    [[-1, 10], 1, Concat, [1]],
    [-1, 3, C2f, [512]],
    [[17, 20, 23], 1, Detect, [nc, anchors]],
  ]